SSAD/test/web-app/src/req/index.org
#+TITLE: Client Requirements for the User Directory Application
#+AUTHOR: VLEAD
#+DATE: [2016-05-11 Wed]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Application:  A web-based directory of users
:PROPERTIES:
:CUSTOM_ID: requirements
:END: 
 The application is a simple directory of users and some related
 information (name and email).  The system has users.  There is a
 special role for some users called =Role_Admin=.

  1. Viewing the details of a user,
  2. Creating a user,
  3. Updating the details of that user,
  4. Deleting a user.  

The rest of the sections have more detailed requirements. 


* User
:PROPERTIES:
:CUSTOM_ID: req_user
:END: 
  User is an entity in the system.  There are several user(s) in the system
  whose type is =User=.  The interaction of a user with the system is defined
  by the requirements below. 

** Composition
:PROPERTIES:
:CUSTOM_ID: req_user_composition
:END: 
   The system has users.
   Realized in data model as [[../data-model/index.org::#user_session_sets][user-set]]



** User Identification
:PROPERTIES:
:CUSTOM_ID: req_user_identification
:END: 
   Each user has an email address (string that corresponds to a
   valid email addr).  

   Realized in data model as [[../data-model/index.org::#cardinal_constraints][cardinality]] and [[../data-model/index.org::#referential_constraints][referential]] constraints on [[../data-model/index.org::#entity_email][Email]]
   entity.


** Uniqueness of a User
:PROPERTIES:
:CUSTOM_ID: req_user_uniqueness
:END: 
   Email identifies a user.  Two users with the same email
   are the same users. 

   Realized in data model as [[../data-model/index.org::#cardinal_constraints][cardinality]] and [[../data-model/index.org::#referential_constraints][referential]] constraints on [[../data-model/index.org::#entity_email][Email]]
   entity.

** Name Attribute

** Role of a User
  :PROPERTIES: 
:CUSTOM_ID: req_user_role
:END: 
   Each user has one or more role, and by default when a user is created, the
   role that is associated with the newly created user is =user=
   
   Realized in data model as [[../data-model/index.org::#cardinal_constraints][cardinality]] and [[../data-model/index.org::#referential_constraints][referential]] constraints on [[../data-model/index.org::#entit_role][Role]]
   entity.


* Name
:PROPERTIES:
:CUSTOM_ID: req_user_name
:END: 
   Each user has a Name (string).

   Realized in data model as [[../data-model/index.org::#cardinal_constraints][cardinality]] and [[../data-model/index.org::#referential_constraints][referential]] constraints on [[../data-model/index.org::#entity_name][Name]] entity.


* Email
:PROPERTIES:
:CUSTOM_ID: req_user_email
:END: 
   Each user has a Email (string).

   Realized in data model as [[../data-model/index.org::#cardinal_constraints][cardinality]] and [[../data-model/index.org::#referential_constraints][referential]] constraints on [[../data-model/index.org::#entity_name][Email]] entity.


* Role
:PROPERTIES: 
:CUSTOM_ID: req_role
:END: 
  Different privileges for accessing the system is maintained by roles.  A role
  whose type is =Role= defines a set of privileges i.e. what is accessible and
  what is not accessible in the system.

  Realized in data model as [[../data-model/index.org::#entity_role][Role]]

** Role Mapping to a User
:PROPERTIES:
:CUSTOM_ID: req_role_mapping_to_user
:END: 
   Each user is mapped to exactly one role in a given session, In any given
   session, a user is mapped to only one of the roles associated with that
   user 

   Realized in data model as [[../data-model/index.org::#cardinal_constraints][cardinalility]] and [[../data-model/index.org::#referential_constraints][referential]] constraints on [[../data-model/index.org::#entity_role][Role]] and
   [[../data-model/index.org::#entity_user][User]] entities.


** Types of Roles
:PROPERTIES:
:CUSTOM_ID: req_role_types
:END: 
   There are 2 kinds of roles: =admin= and =user=.  Each role determines what
   data access privileges are available to the user.   


** Role Privileges
:PROPERTIES:
:CUSTOM_ID: req_role_privileges
:END:    

   1. A user with role =admin= has the ability to:

      1. Create a new user, Read and Update information of all users, and
         Delete all other users.

   2. A user with role =user= has the ability to:

      1. View certain information of other users in the system.

      2. Update his/her information. 
      

** User with =admin= role
:PROPERTIES:
:CUSTOM_ID: req_role_admin
:END:    
   There is atleast one user with role =admin= in the system.

   Realized in data model as an [[../data-model/index.org::#admin_user][admin user]]


* Questions/scenarios

** System with no user?
:PROPERTIES:
:CUSTOM_ID: sys-with-no-user
:END:

- Question :: Is it possible for the system to have no users?
  Answer :: No



** System with no admin?
:PROPERTIES:
:CUSTOM_ID: sys-with-no-admin
:END:

- Question :: Is it possible for the system to have no user
     with role admin?

- Answer :: No.  


** System  with at least one admin? 
:PROPERTIES:
:CUSTOM_ID: user-with-at-least-one-admin
:END:

- Question :: Is it possible for the system to have one user
     role with admin?

- Answer :: Yes.  

