SSAD/test/web-app/build/docs/req/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Client Requirements for the User Directory Application</title>
<!-- 2017-08-31 Thu 18:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../style/css/override.css" />
<link rel="icon" type="image/png" href="../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Client Requirements for the User Directory Application</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#requirements">1. Application:  A web-based directory of users</a></li>
<li><a href="#req_user">2. User</a>
<ul>
<li><a href="#req_user_composition">2.1. Composition</a></li>
<li><a href="#req_user_identification">2.2. User Identification</a></li>
<li><a href="#req_user_uniqueness">2.3. Uniqueness of a User</a></li>
<li><a href="#sec-2-4">2.4. Name Attribute</a></li>
<li><a href="#req_user_role">2.5. Role of a User</a></li>
</ul>
</li>
<li><a href="#req_user_name">3. Name</a></li>
<li><a href="#req_user_email">4. Email</a></li>
<li><a href="#req_role">5. Role</a>
<ul>
<li><a href="#req_role_mapping_to_user">5.1. Role Mapping to a User</a></li>
<li><a href="#req_role_types">5.2. Types of Roles</a></li>
<li><a href="#req_role_privileges">5.3. Role Privileges</a></li>
<li><a href="#req_role_admin">5.4. User with <code>admin</code> role</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Questions/scenarios</a>
<ul>
<li><a href="#sys-with-no-user">6.1. System with no user?</a></li>
<li><a href="#sys-with-no-admin">6.2. System with no admin?</a></li>
<li><a href="#user-with-at-least-one-admin">6.3. System  with at least one admin?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-requirements" class="outline-2">
<h2 id="requirements"><a id="sec-1" name="sec-1"></a><span class="section-number-2">1</span> Application:  A web-based directory of users</h2>
<div class="outline-text-2" id="text-requirements">
<p>
The application is a simple directory of users and some related
information (name and email).  The system has users.  There is a
special role for some users called <code>Role_Admin</code>.
</p>

<ol class="org-ol">
<li>Viewing the details of a user,
</li>
<li>Creating a user,
</li>
<li>Updating the details of that user,
</li>
<li>Deleting a user.  
</li>
</ol>

<p>
The rest of the sections have more detailed requirements. 
</p>
</div>
</div>


<div id="outline-container-req_user" class="outline-2">
<h2 id="req_user"><a id="sec-2" name="sec-2"></a><span class="section-number-2">2</span> User</h2>
<div class="outline-text-2" id="text-req_user">
<p>
User is an entity in the system.  There are several user(s) in the system
whose type is <code>User</code>.  The interaction of a user with the system is defined
by the requirements below. 
</p>
</div>

<div id="outline-container-req_user_composition" class="outline-3">
<h3 id="req_user_composition"><a id="sec-2-1" name="sec-2-1"></a><span class="section-number-3">2.1</span> Composition</h3>
<div class="outline-text-3" id="text-req_user_composition">
<p>
The system has users.
Realized in data model as <a href="../data-model/index.html#user_session_sets">user-set</a>
</p>
</div>
</div>



<div id="outline-container-req_user_identification" class="outline-3">
<h3 id="req_user_identification"><a id="sec-2-2" name="sec-2-2"></a><span class="section-number-3">2.2</span> User Identification</h3>
<div class="outline-text-3" id="text-req_user_identification">
<p>
Each user has an email address (string that corresponds to a
valid email addr).  
</p>

<p>
Realized in data model as <a href="../data-model/index.html#cardinal_constraints">cardinality</a> and <a href="../data-model/index.html#referential_constraints">referential</a> constraints on <a href="../data-model/index.html#entity_email">Email</a>
entity.
</p>
</div>
</div>


<div id="outline-container-req_user_uniqueness" class="outline-3">
<h3 id="req_user_uniqueness"><a id="sec-2-3" name="sec-2-3"></a><span class="section-number-3">2.3</span> Uniqueness of a User</h3>
<div class="outline-text-3" id="text-req_user_uniqueness">
<p>
Email identifies a user.  Two users with the same email
are the same users. 
</p>

<p>
Realized in data model as <a href="../data-model/index.html#cardinal_constraints">cardinality</a> and <a href="../data-model/index.html#referential_constraints">referential</a> constraints on <a href="../data-model/index.html#entity_email">Email</a>
entity.
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Name Attribute</h3>
</div>

<div id="outline-container-req_user_role" class="outline-3">
<h3 id="req_user_role"><a id="sec-2-5" name="sec-2-5"></a><span class="section-number-3">2.5</span> Role of a User</h3>
<div class="outline-text-3" id="text-req_user_role">
<p>
Each user has one or more role, and by default when a user is created, the
role that is associated with the newly created user is <code>user</code>
</p>

<p>
Realized in data model as <a href="../data-model/index.html#cardinal_constraints">cardinality</a> and <a href="../data-model/index.html#referential_constraints">referential</a> constraints on <a href="../data-model/index.html#entit_role">Role</a>
entity.
</p>
</div>
</div>
</div>


<div id="outline-container-req_user_name" class="outline-2">
<h2 id="req_user_name"><a id="sec-3" name="sec-3"></a><span class="section-number-2">3</span> Name</h2>
<div class="outline-text-2" id="text-req_user_name">
<p>
Each user has a Name (string).
</p>

<p>
Realized in data model as <a href="../data-model/index.html#cardinal_constraints">cardinality</a> and <a href="../data-model/index.html#referential_constraints">referential</a> constraints on <a href="../data-model/index.html#entity_name">Name</a> entity.
</p>
</div>
</div>


<div id="outline-container-req_user_email" class="outline-2">
<h2 id="req_user_email"><a id="sec-4" name="sec-4"></a><span class="section-number-2">4</span> Email</h2>
<div class="outline-text-2" id="text-req_user_email">
<p>
Each user has a Email (string).
</p>

<p>
Realized in data model as <a href="../data-model/index.html#cardinal_constraints">cardinality</a> and <a href="../data-model/index.html#referential_constraints">referential</a> constraints on <a href="../data-model/index.html#entity_name">Email</a> entity.
</p>
</div>
</div>


<div id="outline-container-req_role" class="outline-2">
<h2 id="req_role"><a id="sec-5" name="sec-5"></a><span class="section-number-2">5</span> Role</h2>
<div class="outline-text-2" id="text-req_role">
<p>
Different privileges for accessing the system is maintained by roles.  A role
whose type is <code>Role</code> defines a set of privileges i.e. what is accessible and
what is not accessible in the system.
</p>

<p>
Realized in data model as <a href="../data-model/index.html#entity_role">Role</a>
</p>
</div>

<div id="outline-container-req_role_mapping_to_user" class="outline-3">
<h3 id="req_role_mapping_to_user"><a id="sec-5-1" name="sec-5-1"></a><span class="section-number-3">5.1</span> Role Mapping to a User</h3>
<div class="outline-text-3" id="text-req_role_mapping_to_user">
<p>
Each user is mapped to exactly one role in a given session, In any given
session, a user is mapped to only one of the roles associated with that
user 
</p>

<p>
Realized in data model as <a href="../data-model/index.html#cardinal_constraints">cardinalility</a> and <a href="../data-model/index.html#referential_constraints">referential</a> constraints on <a href="../data-model/index.html#entity_role">Role</a> and
<a href="../data-model/index.html#entity_user">User</a> entities.
</p>
</div>
</div>


<div id="outline-container-req_role_types" class="outline-3">
<h3 id="req_role_types"><a id="sec-5-2" name="sec-5-2"></a><span class="section-number-3">5.2</span> Types of Roles</h3>
<div class="outline-text-3" id="text-req_role_types">
<p>
There are 2 kinds of roles: <code>admin</code> and <code>user</code>.  Each role determines what
data access privileges are available to the user.   
</p>
</div>
</div>


<div id="outline-container-req_role_privileges" class="outline-3">
<h3 id="req_role_privileges"><a id="sec-5-3" name="sec-5-3"></a><span class="section-number-3">5.3</span> Role Privileges</h3>
<div class="outline-text-3" id="text-req_role_privileges">

<ol class="org-ol">
<li>A user with role <code>admin</code> has the ability to:

<ol class="org-ol">
<li>Create a new user, Read and Update information of all users, and
Delete all other users.
</li>
</ol>
</li>

<li>A user with role <code>user</code> has the ability to:

<ol class="org-ol">
<li>View certain information of other users in the system.
</li>

<li>Update his/her information. 
</li>
</ol>
</li>
</ol>
</div>
</div>


<div id="outline-container-req_role_admin" class="outline-3">
<h3 id="req_role_admin"><a id="sec-5-4" name="sec-5-4"></a><span class="section-number-3">5.4</span> User with <code>admin</code> role</h3>
<div class="outline-text-3" id="text-req_role_admin">
<p>
There is atleast one user with role <code>admin</code> in the system.
</p>

<p>
Realized in data model as an <a href="../data-model/index.html#admin_user">admin user</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Questions/scenarios</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sys-with-no-user" class="outline-3">
<h3 id="sys-with-no-user"><a id="sec-6-1" name="sec-6-1"></a><span class="section-number-3">6.1</span> System with no user?</h3>
<div class="outline-text-3" id="text-sys-with-no-user">

<dl class="org-dl">
<dt> Question </dt><dd>Is it possible for the system to have no users?
Answer :: No
</dd>
</dl>
</div>
</div>



<div id="outline-container-sys-with-no-admin" class="outline-3">
<h3 id="sys-with-no-admin"><a id="sec-6-2" name="sec-6-2"></a><span class="section-number-3">6.2</span> System with no admin?</h3>
<div class="outline-text-3" id="text-sys-with-no-admin">

<dl class="org-dl">
<dt> Question </dt><dd>Is it possible for the system to have no user
with role admin?
</dd>

<dt> Answer </dt><dd>No.  
</dd>
</dl>
</div>
</div>


<div id="outline-container-user-with-at-least-one-admin" class="outline-3">
<h3 id="user-with-at-least-one-admin"><a id="sec-6-3" name="sec-6-3"></a><span class="section-number-3">6.3</span> System  with at least one admin?</h3>
<div class="outline-text-3" id="text-user-with-at-least-one-admin">

<dl class="org-dl">
<dt> Question </dt><dd>Is it possible for the system to have one user
role with admin?
</dd>

<dt> Answer </dt><dd>Yes.  
</dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2016-05-11 Wed]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-08-31 Thu 18:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
